In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'city': ['Lille', 'Paris', 'Lyon', 'Marseille', 'Aubenas'],
    'year': [2000, 2001, 2002, 2001, 2020],
    'pop': [0.232, 2.141, 0.513, 0.861, 0.012]
}

df = pd.DataFrame(data, index=['59', '75', '69', '13', '07'])

In [3]:
df

         city  year    pop
59      Lille  2000  0.232
75      Paris  2001  2.141
69       Lyon  2002  0.513
13  Marseille  2001  0.861
07    Aubenas  2020  0.012

In [10]:
# Deux crochets on extrait une colonne dans un DataFrame
print( type( df[['city']] ) )

df[['city']]

<class 'pandas.core.frame.DataFrame'>

         city
59      Lille
75      Paris
69       Lyon
13  Marseille
07    Aubenas

In [12]:
# une paire de crochets on extrait une colonne dans une série
print( type( df['city'] ) )

df['city']

<class 'pandas.core.series.Series'>

59        Lille
75        Paris
69         Lyon
13    Marseille
07      Aubenas
Name: city, dtype: object

In [15]:
df[ ['city', 'year'] ]

         city  year
59      Lille  2000
75      Paris  2001
69       Lyon  2002
13  Marseille  2001
07    Aubenas  2020

df['city', 'year'] ne marche pas une série n'a qu'une colonne il faut mettre des doubles crochets pour extraires doubles crochets df[ ['city', 'year']]